Page({

  /**
   * 页面的初始数据
   */
  data: {
    problems: [],
    active: null,
  },
  //初始化方法
  _init() {
    this.setData({
      problems: [{
          "title": "1. 邀请好友赞助",
          "about": ['分享到群可以直接获得2000步（每日上限10个群）', '邀请新用户可获得1000步', '好友可选择赞助您，每日最高10000步', '每月好友间相互仅可赠送4次']
        },
        {
          "title": "2. 坚持连续运动签到",
          "about": ['每日签到可获得相应的步步币奖励，坚持7天/30天还有额外特权礼品。']
        },
        {
          "title": "3. 运动打卡",
          "about": ['分享运动打卡到好友或者朋友圈，每位新用户扫码进入您可获得5个步步币奖励。']
        },
      ]
    })
  },
  onLoad: function(options) {
    this._init();
  },

})